[{
  "id": "1a2db1c3-a454-4071-af95-ed670589526f",
  "text": "# This is a main heading\n## This is a sub heading\n### This is a sub sub heading\n\nThis is a normal Paragraph for bald headed people with no beards.\n\n**This text is bold** (Cmd-B)\n*Italicized* for you Italians (Cmd-I)\n~~Strikethrough~~ for those who like it!\n\n> and this is a Blockquote (Cmd-')\n\nWe have lists: (Cmd-Alt-L)\n\n1. Here\n2. Here\n3. and Here\n\nWe have bullets: (Cmd-L)\n\n* Pew\n* Pew\n* and Pew!\n  * What about nesting\n  * Oh it automatically adds the next one!\n  * That's actually quite nice.\n* And i can unindent too? This is just too good. I'm gonna have to steal this and make it my own\n\nLook how simple it is!\n```javascript\ntextarea1 = mirrorMark(document.getElementById(\"textarea1\"), { autofocus: true });\ntextarea1.render();\n```\n\n[We have links](http://cdn.meme.am/instances/500x/54432752.jpg) (Cmd-K)\n\nWe even have images (Cmd-Alt-I)\n![Markdown Everywhere](http://troll.me/images/toy-story-everywhere/markdown-markdown-everywhere.jpg)\n\n<table>\n\t<tr>\n\t\t<td>Embedded Html</td>\n\t</tr>\n</table>\n\nso if I start writing from here, if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, \n\nthen I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.if I can update the styling here, then I'm doing a great job.\n\nLet's see how this looks on mobile. I will have to update the width of this thing so it doesn't go below the \n\n\nI can actually just keep typing here\nlike I don't have a care in the world.\n\nEverything seems to be working fine, and I'm totally happy with how it's going so far. At the moment, I don't feel the need to update anything further, so I'm not going to",
  "created": "2020-02-11T16:06:58+00:00"
}, {
  "id": "088e4862-b9a0-49fa-bbdb-374816d1756f",
  "text": "# This is a main heading\n## This is a sub heading\n### This is a sub sub heading\n#### This is a sub sub heading\n##### This is a sub sub heading\n\nThis is a normal Paragraph for bald headed people with no beards.\n\n**This text is bold** (Cmd-B)\n*Italicized* for you Italians (Cmd-I)\n_**Bold and Italicized**_ like a pro\n~~Strikethrough~~ for those who like it!\n\n> and this is a Blockquote (Cmd-')\n> dshjksdfdsjklsadf\n> so each lin\n\ndslkjsdfas\ndsffjkl\n\nWe have lists: (Cmd-Alt-L)\n\n1. Here\n2. Here\n3. and Here\n\nWe have bullets: (Cmd-L)\n\n* Pew\n* Pew\n* and Pew!\n\n1. Adding a list\n2. Seeing how it highlights and stuff\n\nLook how simple it is!\n```javascript\ntextarea1 = mirrorMark(document.getElementById(\"textarea1\"), { autofocus: true });\ntextarea1.render();\n```\n\n[We have links](http://cdn.meme.am/instances/500x/54432752.jpg) (Cmd-K)\n\nWe even have images (Cmd-Alt-I)\n![Markdown Everywhere](http://troll.me/images/toy-story-everywhere/markdown-markdown-everywhere.jpg)\n\n<table>\n\t<tr>\n\t\t<td>Embedded Html</td>\n\t</tr>\n</table>\n\nAnd notice those sneaky preview and fullscreen buttons?\nkjlh kjlhkj kjhkhkjhlasdhjkasfd\nasdf\nasdfas\nfdasdjklfhasdf\nsadfjklhasdf\nasdfljkasdf\nasdfasdfjklasdf\nsadfjklasd\n\nThis is actually way more clutch for realizing my goal.\n\nI'm not 100% sure what I want to do with it at the moment, but this definitely works a lot better in keep ing track of how many words I've written so far.\n\nOkay this looks a lot better\n\nAnd I'm adding to the total word count as time goes by. Yeah that is hella nice to see the word count go up as I type. I alost just want to look at that because it's so clutch to see how much I'm typing!!\n\nI'm like super vibing with this app now. It's starting to have it's own personality and everything.\n\nPlus it works really smooth and is absolutely heping me accomplish my goal of getting a bunch of writing done.\n\nIt could be prettier for sure, but for now it absolutely gets the job done. I like that the nav is so subtle and just moves down the page with you. The word goal at the bottom is okay because I don't really want to see it. It can feel kinda far away, but seeing the words count typing as I make progress is a really dope feeling.\n\nOooh I could even add some feedback about not backspacing the writing. Just making it red and adding some microcopy would encourage users (me) to keep adding text and not erase anything.\n\nI could eventually have a mascot or face that looks like it's in pain whenever I backspace anything. THe focus here is to just get the thoughts out without judging or erasing things.\n\nI think I am actually getting faster at typing from doing it so much. Really the overall vision for this app is to help you become a better you.\n\nthings that it helps with:\n\n* Building a writing habit\n* Becoming a better writer\n* Type faster\n* Learn more about your emotional health\n* Keep track of how you grow over time\n\nEtc.\n\nYeah having markdown for moments like this is absolutely clutch. The preview feature is a nice to have, but I barely use it. What I really wanted is more live markdown visuals so I can see nicely formatted text as I write it",
  "created": "2020-02-12T15:38:57+00:00"
}, {
}, {
  "id": "088e4862-b9a0-49fa-bbdb-374816d1756f",
  "text": "# This is a main heading\n## This is a sub heading\n### This is a sub sub heading\n#### This is a sub sub heading\n##### This is a sub sub heading\n\nThis is a normal Paragraph for bald headed people with no beards.\n\n**This text is bold** (Cmd-B)\n*Italicized* for you Italians (Cmd-I)\n_**Bold and Italicized**_ like a pro\n~~Strikethrough~~ for those who like it!\n\n> and this is a Blockquote (Cmd-')\n> dshjksdfdsjklsadf\n> so each lin\n\ndslkjsdfas\ndsffjkl\n\nWe have lists: (Cmd-Alt-L)\n\n1. Here\n2. Here\n3. and Here\n\nWe have bullets: (Cmd-L)\n\n* Pew\n* Pew\n* and Pew!\n\n1. Adding a list\n2. Seeing how it highlights and stuff\n\nLook how simple it is!\n```javascript\ntextarea1 = mirrorMark(document.getElementById(\"textarea1\"), { autofocus: true });\ntextarea1.render();\n```\n\n[We have links](http://cdn.meme.am/instances/500x/54432752.jpg) (Cmd-K)\n\nWe even have images (Cmd-Alt-I)\n![Markdown Everywhere](http://troll.me/images/toy-story-everywhere/markdown-markdown-everywhere.jpg)\n\n<table>\n\t<tr>\n\t\t<td>Embedded Html</td>\n\t</tr>\n</table>\n\nAnd notice those sneaky preview and fullscreen buttons?\nkjlh kjlhkj kjhkhkjhlasdhjkasfd\nasdf\nasdfas\nfdasdjklfhasdf\nsadfjklhasdf\nasdfljkasdf\nasdfasdfjklasdf\nsadfjklasd\n\nThis is actually way more clutch for realizing my goal.\n\nI'm not 100% sure what I want to do with it at the moment, but this definitely works a lot better in keep ing track of how many words I've written so far.\n\nOkay this looks a lot better\n\nAnd I'm adding to the total word count as time goes by. Yeah that is hella nice to see the word count go up as I type. I alost just want to look at that because it's so clutch to see how much I'm typing!!\n\nI'm like super vibing with this app now. It's starting to have it's own personality and everything.\n\nPlus it works really smooth and is absolutely heping me accomplish my goal of getting a bunch of writing done.\n\nIt could be prettier for sure, but for now it absolutely gets the job done. I like that the nav is so subtle and just moves down the page with you. The word goal at the bottom is okay because I don't really want to see it. It can feel kinda far away, but seeing the words count typing as I make progress is a really dope feeling.\n\nOooh I could even add some feedback about not backspacing the writing. Just making it red and adding some microcopy would encourage users (me) to keep adding text and not erase anything.\n\nI could eventually have a mascot or face that looks like it's in pain whenever I backspace anything. THe focus here is to just get the thoughts out without judging or erasing things.\n\nI think I am actually getting faster at typing from doing it so much. Really the overall vision for this app is to help you become a better you.\n\nthings that it helps with:\n\n* Building a writing habit\n* Becoming a better writer\n* Type faster\n* Learn more about your emotional health\n* Keep track of how you grow over time\n\nEtc.\n\nYeah having markdown for moments like this is absolutely clutch. The preview feature is a nice to have, but I barely use it. What I really wanted is more live markdown visuals so I can see nicely formatted text as I write it",
  "created": "2020-02-13T22:24:26+00:00"
}, {
  "id": "29372e68-01ce-49a2-a707-15bb6064a2c0",
  "text": "Happy Valentine's Day to me!\n\nHaha I was not expecting to have to pay back my student loans so soon! I guess it has been a year since I stopped going to school. The beginning of last year at this time I was waiting to go to Halliburton to start making some bank there.\n\nI didn't really care for the position in the end, but it did help me make some money and pay for that expensive ass apartment.\n\nRight now, I need to increase my income and that is quite crucial for me.\n\nI have until June to work through the details of what I'm going to do, and I think that is plenty of time as long as I stay consistent and make it easy on myself to the right thing.\n\nRight now, that means I need to get Atomic Habits again and use it to completely rearrange how I'm currently living my life.\n\nI was supposed to do a 5k, but my feet and stuff have been hurting pretty bad. That probably means I need to get some insoles or something to prevent myself from having terrible shin splints, but there are also other things that I can do too.\n\nHonestly, the most important thing for me to figure out is what I am going to consistently work at. I think as long as I stay consistent, I'm gonna be good.\n\nCurrently I've already decided that I want to provide educational resources for entrepreneur who want to fast track themselves into building cross-platform applications. This means app that will work on all devices and minimize the amount of languages that they will need to learn and be comfortable with.\n\nI think that this is a great vision, and as long as I stick to it, I will make money and help a lot of people along the way. What's most important for me is to make sure my daily actions are continually pushing the dial without overworking myself.\n\nI will absolutely succeed, and this is my vow to stay consistent and work to the best of my ability to focus on the positive and work my best to capitalize on the opportunity that is presented to me.\n\nI don't know what the fuck I'm supposed to do, but I do know that as long as I continue to do my best, I will see results. I don't need to even be concerned about the student loan shit at all.\n\nYeah the number might go up, but it will legitimately be much higher if I take out even more loans to go back to school and finish up there.\n\nPresently, I have the opportunity to stay in Austin and train the next wave of entrepreneurial developers.\n\nI have the skills and am learning how to improve them on a regular basis. I really at this point have to make sure that I stay consistent about watching my income and making it go exactly where it needs to.\n\nTHat is the biggest habit that I am lacking in, so it's time to take care of that shit once and for all.\n\nToday, I'm going to continue working on the app since I enjoy it and that's that. Everything else that stresses me out and makes me want ot do more unproductive things is simply a distraction.\n\nI want to go to Tony's game, but I'm not gonna be able to go to this one today. I can go to his last game next week though.\n\nShit, this is a lot to think about, but I have done enough at this point and I will be okay as long as I don't stress myself out.\n\nI think an insanely important exercise will be to visualize the success I want to see on a daily basis. I have been putting off the mental and spiritual side of what I should be doing because I haven't really considered how much belief plays a huge role in everything that we do, but not I really do want to make sure that my mental is good everyday.\n\nMeditation might be useful, but the version that I have been doing kinda sucks. I think I would much rather put myself into an excited state that encourages me to create than to completely wipe my mind of all the energy that I have.\n\nI like how I feel after a workout more than how I feel after meditation.\n\nIt makes more sense for me to pursue the workout mode than the mediation mode.\n\nIight, so I got this. I really am going to stick to this niche and do my best to shape my personal brand around it. For now, that means focusing on creating a dope site for my personal site and also working on the landing page for my writing app.\n\nI need to get clients flowing in from both directions. I can optimize later, but I want to have entrepreneurial clients that i consistently work with and help them get the skills to create the apps and businesses that they would like to create within the next year or so.\n\nThat's what I want for myself as well, so I can learn more of the business side from them as I continue to grow myself and the skills I have in both business and code.\n\nI pretty much have an outline of a gameplan together for Mark, so we can pursue that together and I can focus a lot of my energy on helping him throughout the week. I think that's another thing that managing my finances better will help me do.\n\nCurrently, I don't feel free to work because I'm constantly thinking about whether I'll have enough money to take care of myself, my bills, and everything else. Figuring out the financial situation and automating that as much as possible will be a critical step and gaining financial freedom. It will also help me optimize my time in creating content that will truly help me expand my finances.\n\nSo today, I just want to get my site working to the point that I have the minimum set of features I decided on previously, and from there the goal is to start working on a landing page for the site.\n\nOnce I have that, then I can create a coming soon page and start to invite people to the beta based on survey input. Those who complete the survey will be the ones I know are most dedicated to helping see the success of this app, so that will definitely give me the confidence that I will have people that want to pay for the product I'm creating.\n\nI already have a few people who are interested, so I can focus on creating this app with them in mind.\n\nAnd really, the key person that I'm making this for is me and people like me. I have some things that I need to deal with, so this is meant to help me work through those things.\n\nI also had some features that I personally wanted, so this will give me those first and foremost. Ba",
  "created": "2020-02-14T22:24:26+00:00"
}]